//---------------------------------------------------------------------------
#pragma once
//---------------------------------------------------------------------------
#include <vector>
#include <cstdint>
//---------------------------------------------------------------------------



namespace mrpc {


/// Интерфейс объекта, который будет обрабатывать сетевые запросы (серванта)
class i_driver_rp
{
  public:

    /// Запрос на отработать новую команду с другой стороны
    virtual void handle_net_request(uint32_t adw_req_id, 
      uint32_t adw_func_id, std::vector<uint8_t>&& a_vec_request) = 0;

    /// Запрос отрабоать асинхронный ответ
    virtual void handle_net_answer(uint32_t adw_req_id, std::vector<uint8_t>&& a_vec_answer) = 0;

};
//---------------------------------------------------------------------------


} // mrpc