//---------------------------------------------------------------------------
#pragma once
//---------------------------------------------------------------------------



namespace mrpc {

//---------------------------------------------------------------------------
class i_driver;
//---------------------------------------------------------------------------


/// Интерфейс уведомления о подключении нового драйвера:
class i_listen_rp
{
  public:

    /// информируем что к серверу кто-то подключился
    virtual void notify_new_drv_income(std::shared_ptr<mrpc::i_driver> a_drv) = 0;

    /// информинуем что мы подключились к серверу
    virtual void notify_new_drv_connect(std::shared_ptr<mrpc::i_driver> a_drv) = 0;

};
//---------------------------------------------------------------------------


} // mrpc